tap "cjbassi/gotop"
tap "golangci/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "peripheryapp/periphery"
tap "rs/tap"
brew "autoconf"
brew "automake"
brew "openssl@1.1"
brew "awscli"
brew "cmake"
brew "coreutils"
brew "go"
brew "dep"
brew "dos2unix"
brew "drone-cli"
brew "emacs"
brew "fish"
brew "flac"
brew "fswatch"
brew "libtool"
brew "git"
brew "gnupg"
brew "go@1.13"
brew "gotop"
brew "htop"
brew "imagemagick"
brew "jq"
brew "lame"
brew "libyaml"
brew "mas"
brew "mp4v2"
brew "node"
brew "openjdk"
brew "openjdk@11"
brew "pgcli"
brew "pkg-config"
brew "postgresql", restart_service: true
brew "postgis"
brew "protoc-gen-go"
brew "telnet"
brew "tree"
brew "vegeta"
brew "wget"
brew "zlib"
brew "golangci/tap/golangci-lint"
brew "rs/tap/jaggr"
cask "1password"
cask "adoptopenjdk8"
cask "authy"
cask "azure-data-studio"
cask "calibre"
cask "charles"
cask "datagrip"
cask "dbeaver-community"
cask "docker"
cask "dotnet-sdk"
cask "font-hack-nerd-font"
cask "google-photos-backup-and-sync"
cask "iterm2"
cask "kitematic"
cask "microsoft-remote-desktop-beta"
cask "periphery"
cask "postman"
cask "slack"
cask "sourcetree"
cask "spectacle"
cask "transmission"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visual-studio-code"
cask "vlc"
mas "AdBlock", id: 1402042596
mas "Bear", id: 1091189122
mas "Developer", id: 640199958
mas "iMazing HEIC Converter", id: 1292198261
mas "Microsoft To Do", id: 1274495053
mas "Pages", id: 409201541
mas "Playgrounds", id: 1496833156
mas "Xcode", id: 497799835
